In [1]:
import sqlite3

In [2]:
#creating a table with 3 columns
conn = sqlite3.connect('employee.db')
c = conn.cursor()
c.execute("""CREATE TABLE employeees (
            first_name text,
            last_name text,
            pay integer
            )""")
conn.commit()  #commiting the changes
conn.close() #closing the connection

### Using findone and findall

In [3]:
conn= sqlite3.connect('employee.db')
c = conn.cursor()
c.execute("INSERT INTO employeees VALUES ('Arun', 'Mohan', 120000)")
conn.commit() #commiting the changes
c.execute("INSERT INTO employeees VALUES ('Ajith', 'Mohan', 10000)")
conn.commit()
c.execute("INSERT INTO employeees VALUES ('Kevin', 'P', 10045)")
conn.commit()
c.execute("INSERT INTO employeees VALUES ('Arun', 'M', 105)")
conn.commit()
conn.close()

In [4]:
conn= sqlite3.connect('employee.db')
c = conn.cursor()
c.execute("SELECT * FROM employeees where first_name == 'Arun'")
print(c.fetchone())
conn.commit()
conn.close()

('Arun', 'Mohan', 120000)

In [5]:
conn= sqlite3.connect('employee.db')
c = conn.cursor()
c.execute("SELECT * FROM employeees where first_name == 'Arun'")
print(c.fetchall())  #print all outputs in list
conn.commit()
conn.close()

[('Arun', 'Mohan', 120000), ('Arun', 'M', 105)]

### Using Placeholders

In [13]:
from employee import Employee #loading the format as a function
emp1 = Employee('Raj','Kumar','999')
emp2 = Employee('Lalu','K','999000')
c = conn.cursor()
c.execute("INSERT INTO employeees VALUES (:one, :two, :three)",({"one":emp1.first,"two":emp1.last,"three":emp1.pay}))
conn.commit()
conn.close()

In [14]:
conn= sqlite3.connect('employee.db')
c = conn.cursor()
c.execute("SELECT * FROM employeees where first_name == 'Raj'")
print(c.fetchone())  #print all outputs in list
conn.commit()
conn.close()

('Raj', 'Kumar', 999)

### Using as dataframe

In [17]:
import pandas as pd
conn= sqlite3.connect('employee.db')
df = pd.read_sql_query("SELECT * FROM employeees",conn)
conn.close()

In [18]:
df.head()

  first_name last_name     pay
0       Arun     Mohan  120000
1      Ajith     Mohan   10000
2      Kevin         P   10045
3       Arun         M     105
4        Raj     Kumar     999